{ "ns" : "http://jsoniq.org/errors", "description" : " This module contains one variable declaration for each diagnostic of the\n http://jsoniq.org/errors namespace.\n The variables serves as documentation for the errors but can also\n be used in the code. For example, one useful scenario is to compare\n an error caught in the catch clause of a try-catch expression with one of\n the variables.\n", "sees" : [  ], "authors" : [ "<xqdoc:author xmlns:xqdoc=\"http://www.xqdoc.org/1.0\">Carlos Lopez</xqdoc:author>" ], "version" : null, "encoding" : "utf-8", "namespaces" : [ { "uri" : "http://jsoniq.org/errors", "prefix" : "jerr" } ], "functions" : [  ], "variables" : [ { "name" : "jerr:JNDY0021", "type" : "xs:QName", "description" : "parser error raised by jn:parse-json\n" }, { "name" : "jerr:JNTY0021", "type" : "xs:QName", "description" : "array or object selector on heterogeneous sequence\n" }, { "name" : "jerr:JNTY0020", "type" : "xs:QName", "description" : "parser error for invalid option type\n" }, { "name" : "jerr:JNTY0024", "type" : "xs:QName", "description" : "objects or arrays don't have a string value\n" }, { "name" : "jerr:JNTY0023", "type" : "xs:QName", "description" : "It is a type error if the prefix is not a string or if the\n serialization parameters are not an element.\n" }, { "name" : "jerr:JNUP0019", "type" : "xs:QName", "description" : "It is a dynamic error if the content expression, in an object insert expression, does not evaluate to a sequence of objects.\n" }, { "name" : "jerr:JNTY0018", "type" : "xs:QName", "description" : "It is a dynamic error if there is not exactly one supplied parameter for an object or array selector.\n" }, { "name" : "jerr:JNUP0017", "type" : "xs:QName", "description" : " It is a dynamic error if the value in a replace expression is not exactly a single item.\n" }, { "name" : "jerr:JNUP0016", "type" : "xs:QName", "description" : "It is a dynamic error if it is attempted to create a replace, delete or rename update primitive with a selector that cannot be resolved against the target array or object.\n" }, { "name" : "jerr:JNSE0022", "type" : "xs:QName", "description" : "It is a dynamic error to serialize a sequence that does\n not exist of exactly one document node with XML, HTML, XHTML, Text.\n" }, { "name" : "jerr:JNSE0014", "type" : "xs:QName", "description" : "It is a dynamic error to serialize a function or a node with the\n JSON output method.\n" }, { "name" : "jerr:JNSE0013", "type" : "xs:QName", "description" : "It is a dynamic error to serialize an atomic value not\n supported by JSON or a node with the JSON output method and with\n the jsoniq-serialization-extensions serialization parameter\n set to false.\n" }, { "name" : "jerr:JNSE0012", "type" : "xs:QName", "description" : "It is a dynamic error to serialize a sequence of less\n or more than one item with the JSON output method if the\n jsoniq-serialization-multiple-items is set to no.\n" }, { "name" : "jerr:JNTY0011", "type" : "xs:QName", "description" : "It is a type error if the content sequence in a node constructor or in an XQUF insert or replace update expression contains an object or an array.\n" }, { "name" : "jerr:JNUP0010", "type" : "xs:QName", "description" : "It is a dynamic error if a pending update list contains two renaming update primitives on the same object and with the same selector.\n" }, { "name" : "jerr:JNUP0009", "type" : "xs:QName", "description" : "It is a dynamic error if a pending update list contains two replacing update primitives on the same object or array, and with the same selector.\n" }, { "name" : "jerr:JNUP0008", "type" : "xs:QName", "description" : "It is a dynamic error if the target of a deleting or replacing expression is not an array or an object.\n It is a dynamic error if the target of a renaming expression is not an object.\n It is a dynamic error if the target of an appending expression is not an array.\n It is a dynamic error if the target of a position-inserting expression is not an array.\n It is a dynamic error if the target of a non-position-inserting expression is not an object.\n" }, { "name" : "jerr:JNUP0007", "type" : "xs:QName", "description" : "It is a type error if, in an updating expression, an array selector cannot be cast to xs:integer or if an object selector cannot be cast to xs:string.\n" }, { "name" : "jerr:JNUP0006", "type" : "xs:QName", "description" : "It is a dynamic error if upd:applyUpdates causes an object to contain two pairs with the same name.\n" }, { "name" : "jerr:JNUP0005", "type" : "xs:QName", "description" : "It is a dynamic error if a pending update list contains two inserting update primitives on the same object and pair name.\n" }, { "name" : "jerr:JNTY0004", "type" : "xs:QName", "description" : "It is a type error to call fn:data on a sequence containing an array or an object.\n" }, { "name" : "jerr:JNDY0003", "type" : "xs:QName", "description" : "It is a dynamic error if two pairs in an object constructor or in a simple object union have the same name.\n" }, { "name" : "jerr:JNTY0002", "type" : "xs:QName", "description" : "It is a type error if the right-hand-side expression of a pair constructor does not return exactly one item.\n" }, { "name" : "jerr:NS", "type" : "item()*", "description" : "" } ] }